-module(guangdong_majiang).

-include("mj_head.hrl").

-export([
	checkSSY/1,
	checkJLBD/1
	]).
%%---------------------------------十三幺
checkSSY(UserPais) ->
   	%（万筒索）1，9各一张， (东、南、西、北、中、发、白) 其中一个为两张，其余为一张
    % 典型  11 19 21 29 31 39 41 43 45 47 51 53 55 55
	MyPais  = majiang:getMyPaisForRecord(UserPais,#r_userMyPai{}),
	{Wan1,Wan9	} = ssyGet19(MyPais#r_userMyPai.wan,{0,0}),
	{Tiao1,Tiao9} = ssyGet19(MyPais#r_userMyPai.tiao,{0,0}),
	{Bing1,Bing9} = ssyGet19(MyPais#r_userMyPai.bing,{0,0}),
	{Dong,Nan,Xi,Bei} = ssyGetFZFB(MyPais#r_userMyPai.feng,{0,0,0,0}),
	{Zhong,Fa,Bai,_} = ssyGetFZFB(MyPais#r_userMyPai.zfb,{0,0,0,0}),

	Sum = Wan1 + Wan9 + Tiao1 + Tiao9 + Bing1 + Bing9 + Dong + Nan + Xi + Bei + Zhong + Fa + Bai,
	case (Wan1 > 0) and (Wan9 > 0) and 
		(Tiao1 > 0) and (Tiao9 > 0) and 
		(Bing1 > 0) and (Bing9 >0) and  
		(Dong > 0) and (Nan > 0) and (Xi > 0) and (Bei > 0) and
		 (Zhong > 0) and (Fa > 0) and (Bai > 0) and (Sum == 14) of
	 	true ->
	 		true;
	 	false ->
	 		false
	 end.
%%统计 1万、9万 个数
ssyGet19([],{N1,N9})->
	{N1,N9};
ssyGet19([A | B],{N1,N9})->
	ssyGet19(B,(
			case majiang:checkSinglePaiNum(A) of
				1 ->
				 	{N1+1,N9};
				9->
					{N1,N9+1};
				_->
					{N1,N9}
			end
		)).
%% 统计东南西北中发白的个数（特殊7是代表北）
ssyGetFZFB([],{Dong,Nan,Xi,Bei})->
	{Dong,Nan,Xi,Bei};
ssyGetFZFB([A | B],{Dong,Nan,Xi,Bei})->	
	ssyGetFZFB(B,(
		case majiang:checkSinglePaiNum(A) of
			1 ->
				{Dong+1,Nan,Xi,Bei};
			3 ->
				{Dong,Nan+1,Xi,Bei};
			5 ->
				{Dong,Nan,Xi+1,Bei};
			7 ->
				{Dong,Nan,Xi,Bei+1};
			_ ->
				{Dong,Nan,Xi,Bei}

	end)).


%%---------------------------------九莲宝灯 
checkJLBD(UserPai)->
	% -- 穷举法
  	% -- 构造新列表 （ 使牌只有牌型和牌号)
	MyPais  = lists:sort(UserPai),
    JLBD_list = [
   [11,11,11,12,13,14,15,16,17,18,19,19,19],
   [11,11,11,11,12,13,14,15,16,17,18,19,19,19],[11,11,11,12,12,13,14,15,16,17,18,19,19,19],
   [11,11,11,12,13,13,14,15,16,17,18,19,19,19],[11,11,11,12,13,14,14,15,16,17,18,19,19,19],
   [11,11,11,12,13,14,15,15,16,17,18,19,19,19],[11,11,11,12,13,14,15,16,16,17,18,19,19,19],
   [11,11,11,12,13,14,15,16,17,17,18,19,19,19],[11,11,11,12,13,14,15,16,17,18,18,19,19,19],
   [11,11,11,12,13,14,15,16,17,18,19,19,19,19],[21,21,21,21,22,23,24,25,26,27,28,29,29,29],
   [21,21,21,22,22,23,24,25,26,27,28,29,29,29],[21,21,21,22,23,23,24,25,26,27,28,29,29,29],
   [21,21,21,22,23,24,24,25,26,27,28,29,29,29],[21,21,21,22,23,24,25,25,26,27,28,29,29,29],
   [21,21,21,22,23,24,25,26,26,27,28,29,29,29],[21,21,21,22,23,24,25,26,27,27,28,29,29,29],
   [21,21,21,22,23,24,25,26,27,28,28,29,29,29],[21,21,21,22,23,24,25,26,27,28,29,29,29,29],
   [31,31,31,31,32,33,34,35,36,37,38,39,39,39],[31,31,31,32,32,33,34,35,36,37,38,39,39,39],
   [31,31,31,32,33,33,34,35,36,37,38,39,39,39],[31,31,31,32,33,34,34,35,36,37,38,39,39,39],
   [31,31,31,32,33,34,35,35,36,37,38,39,39,39],[31,31,31,32,33,34,35,36,36,37,38,39,39,39],
   [31,31,31,32,33,34,35,36,37,37,38,39,39,39],[31,31,31,32,33,34,35,36,37,38,38,39,39,39],
   [31,31,31,32,33,34,35,36,37,38,39,39,39,39]],
   jLBD(JLBD_list,MyPais).

jLBD([],N)->
	false;
jLBD([A | B] , N)->
	case A == N of
		true  ->
			true;
		false ->
            jLBD(B,N)
	end.